# IFC_SetIFCEntity2

## Description
Sets IFC entity type and its default Psets and values from IFC Data Mapping.

```pascal
FUNCTION IFC_SetIFCEntity2(
				hObject      : HANDLE;
				inStrIfcType : STRING) : BOOLEAN;
```

```python

def vs.IFC_SetIFCEntity2(hObject, inStrIfcType):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObject|HANDLE||
|inStrIfcType|STRING||

## Version
Availability: from Vectorworks 2018
## Category
* IFC